/* 

N * N 격자판 모양으로 생긴 지도가 있다. 격자 안에는 지역의 높이가 쓰여있다.
봉우리 지역이 몇 개 있는 지 알아내는 프로그램을 작성하세요.

(하나의 지표에서 상하좌우가 모두 나보다 낮으면 봉우리가 된다.
 가장자리는 모두 0으로 초기화가 되어있다고 가장한다.)
*/

function sol(arr) {
    let answer = 0;
    let n = arr.length;
    let dx = [-1, 0, 1, 0];                 // 0번부터 12, 3, 6, 9시 방향
    let dy = [0, 1, 0, -1];                 // 초기화

    for(let i = 0; i < n; i++){
        for(let j = 0; j < n; j ++){
            for(let k = 0; k < 4; k++){
                if(arr[])
            }
        }
    }
}